target/test-classes/xml/sws/maintainpayment/TC32708_request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
    <soapenv:Header/>
    <soapenv:Body>
        <sel:maintainPaymentRequest>
            <sel:externalSystemID>NETCALL</sel:externalSystemID>
            <sel:action>ADHOC_PAYMENT_NON_ACCOUNT_HOLDER</sel:action>
            <sel:accountNumber>$accountNumber$</sel:accountNumber>
            <sel:ongoingPaymentMethod>CARD</sel:ongoingPaymentMethod>
            <sel:amount>13.00</sel:amount>
            <sel:externalReference>MP-4</sel:externalReference>
            <sel:cardDetails>
                <sel:useExistingCard>false</sel:useExistingCard>
                <sel:cardName>Lisa Chapman</sel:cardName>
                <sel:cardNumber>4539791001730106</sel:cardNumber>
                <sel:cardEndDate>1222</sel:cardEndDate>
                <sel:cardType>DE</sel:cardType>
                <sel:cvv>123</sel:cvv>
            </sel:cardDetails>
            <sel:address>
                <sel:postcode>TW11 0JR</sel:postcode>
            </sel:address>
        </sel:maintainPaymentRequest>
    </soapenv:Body>
</soapenv:Envelope>